#+Title: Computer Science 3MI3 – 2020 homework 9
#+Subtitle: Adding “guarded commands” to Clojure
#+Author: Mark Armstrong
#+Date: November 28th, 2020
#+Description: Exploring a different kind of control structure: the guarded command.
#+Options: num:nil
#+SETUPFILE: ../org-html-themes/setup/theme-readtheorg-local.setup

* Part 0.2: Representing guarded commands in Clojure
:PROPERTIES:
:CUSTOM_ID: Part-0.2:-Representing-guarded-commands-in-Clojure
:END:

We can easily write guarded commands in Clojure
as a record consisting of the ~guard~ and the ~command~.
#+begin_src clojure :tangle ./src/h9/h9.clj
(defrecord GuardedCommand [guard command])
#+end_src

#+RESULTS:
: user.GuardedCommand

We can create an instance of this record as in
#+begin_src clojure
(GuardedCommand. '(> x 5) '(- x 1))
#+end_src

#+RESULTS:
: #user.GuardedCommand{:guard (> x 5), :command (- x 1)}

We can access the fields of these records as if they were maps,
or using syntax based on Java field accessors.
That is, given a ~GuardedCommand~ instance ~grd-cmd~,
we can write e.g., ~(:guard grd-cmd)~ or ~(.command grd-cmd)~.
#+begin_src clojure
(let [grd-cmd (GuardedCommand. '(> x 5) '(- x 1))]
  (printf "The guard of this command is %s\n" (:guard grd-cmd))
  (printf "The command of this command is %s\n" (.command grd-cmd)))
#+end_src

#+RESULTS:

So we will operate on lists or vectors of ~GuardCommands~.

* Part 0.3: An example construct for using guarded commands
:PROPERTIES:
:CUSTOM_ID: Part-0.3:-An-example-construct-for-using-guarded-commands
:END:

To get you started, we define here a /deterministic/ ~if~ construct
operating on guarded commands.

This construct differs from the one you will be tasked to define
in that it always chooses the first command in the sequence
whose guard is true
(instead of nondeterministically/randomly selecting a command.)

#+begin_src clojure
(defn first-allowed-command
  "Find the first command in a sequence of guarded `commands`
whose `.guard` evaluates to a truthy value and return its `.command`.
Returns `nil` if none of the guards are satisfied."
  [commands]
  ;; If the `commands` list is empty, "do nothing" by returning `nil`.
  (if (empty? commands) nil
      ;; Otherwise, deconstruct the `commands` list into
      ;; the first `command` and the `rest`.
      (let [[command & rest] commands]
        ;; Diagnostic print statement, if needed.
        ;(printf "Checking command %s with guard %s and command %s\n" command (.guard command) (.command command))
        ;; Now check the `guard`, and if it's satisfied, return the first `command`.
        (if (eval (.guard command)) (.command command)
            ;; Otherwise, continue to check the `rest` of the guarded commands.
            (first-allowed-command rest)))))

(defmacro guarded-deterministic-if
  "Given a sequence of `GuardedCommands`, `commands`,
select the first guarded command whose `.guard` evaluates
to a truthy value and evaluate its `.command`."
  [& commands]
  ;; The body must be quoted, so that nothing is evaluated until runtime.
  `(eval ;; Evaluate...
    (first-allowed-command ;; ...the command returned by first-allowed-command... 
     [~@commands]))) ;; to which we pass a vector of the commands.
;; The ~@ applied to `commands` here "splices" the elements of `commands` into place here.
;; That is, each element of the sequence `commands` is inserted here in order.
;; But not literally as a sequence (between parentheses or brackets.) Hence we wrap in [].
;; The use of the [] is actually quite particular; using a quoted list, '(...), would not work.
;; Because the guarded commands within would be treated as sequences instead of records.
#+end_src

#+RESULTS:
| #'user/first-allowed-command    |
| #'user/guarded-deterministic-if |

As an example, we use this form to define a ~max~ operation.
#+begin_src clojure
(defn max [x y]
  (guarded-deterministic-if
   ;; For variables to maintain their meaning within a quoted list,
   ;; use the special backtick ` quote and unquote the variables with ~.
   (GuardedCommand. `(>= ~x ~y) x)
   (GuardedCommand. `(>= ~y ~x) y)))
#+end_src

#+RESULTS:
: #'user/max

